// Дискорд-бот "Крипушка"

var that = that || {};

(function(that) {
let Discord = require('discord.js');
let client = new Discord.Client();

let https = require('https');
let http = require('http');

//let that = this;
//console.log(that);

let myToken = process.env.BOT_TOKEN;

// инициализация
let myId = '';
// floodless channels
let floodless = [
	'175956780398936065',
];
// user ids to ignore
let ignores = [
	myId,
];
let hidden = false;
let timestamps = {};

let floodeys = {}; // объект для запоминания
let floodrate = 5; // штрафных секунд за сообщение
let floodmax = 20; // штрафных секунд для получения игнора
let floodchills = 2; // сколько чиллаутов писать перед игнором

let since = Date.now();
that.statLaunches = +!!that.statLaunches + 1;
let stat = {
	readCount: 0,
	replyCount: 0,
	readCountDM: 0,
	replyCountDM: 0,
	chillCount: 0,
	mentionCount: 0,
	errorCount: 0,
	timeSum: 0,
	timeMax: 0,
	timeLast: 0,
	waitMax: 0,
	waitLast: since,
};

// выдаёт true с указанным шансом
function chance(a) {
	return Math.random() < a;
}

// вытаскивание элемента из массива
Object.defineProperty(Array.prototype, 'pick', {value: function(rand) {
	if (typeof rand == 'undefined') {
		// тупо рандомно
		return this[Math.floor(this.length * Math.random())];
	} else {
		// по остатку
		return this[rand % this.length];
	}
}});
// разбивание строки по пробелам и вытаскивание
Object.defineProperty(String.prototype, 'spick', {value: function(rand) {
	return this.split(' ').pick(rand);
}});

let months = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря'];

// приблизительное время создания снежинки
function sfTime(s) {
    return new Date(1420070400000 + s / 4194304);
}

// снежинка по дате
function sfGet(n) {
	return String((n - 1420070400000) * 4194304);
}

let timezoneOffset = 3;
let timezoneSuffix = ' МСК';

// читабельное числовое время в текущей таймзоне
function dateStr(d) {
	if (!d.toJSON) {
		d = new Date(d);
	}
	d.setHours(d.getHours() + timezoneOffset);
	return d.toJSON().split(".")[0].replace(/T/, ' ') + timezoneSuffix;
}

// словесное описание дня
function dateDay(d) {
	return d.getDate() + '-го ' + months[d.getMonth()] + ' ' + d.getFullYear() + ' года';
}

// формы множественного числа
function pluralize(n, arr) {
	let k = n % 10;
	return arr[(n - k) / 10 % 10 != 1 ? (k != 1 ? ([2, 3, 4].includes(k) ? 1 : 2) : 0) : 2];
}

// разница между таймстемпами словами
function dateDiff(diff, plain) {
	// предполагается, что промежуток должен быть > 0
	//let diff = d2 - d1;
	
	let tarr = [1000, 60, 60, 24, 7, Infinity];
	for (let i in tarr) {
		let x = tarr[i];
		tarr[i] = diff % x;
		diff = (diff - tarr[i]) / x;
	}
	
	tarr.shift(); // убираем миллисекунды
	
	let warr = [
		[plain ? 'секунда' : 'секунду', 'секунды', 'секунд'],
		[plain ? 'минута' : 'минуту', 'минуты', 'минут'],
		['час', 'часа', 'часов'],
		['сутки', 'суток', 'суток'],
		[plain ? 'неделя' : 'неделю', 'недели', 'недель'],
	];
	let sarr = [];
	
	for (let i = 4; i >= 0; i--) {
		if (!tarr[i]) {
			continue;
		}
		sarr.push(tarr[i] + ' ' + pluralize(tarr[i], warr[i]));
	}
	
	return sarr.join(', ');
}

// потому что на старой ноде не работает.
// A**B -> (Math.pow(A,B))
function replacePow(s) {
	
	function operand(pos, d) {
		let o = 0; // offset
		let lvl = 0;
		let c;
		
		while (c = s[pos + o + d]) {
			// parentheses
			let op = c == '(';
			let cl = c == ')';
			if (op || cl) {
				lvl += op * d - cl * d;
				if (lvl < 0) {
					lvl = 0;
					break;
				}
			}
			
			// stopping chars
			if (!lvl && ',/%*+-'.indexOf(c) != -1) {
				break;
			}
			
			o += d;
		}
		return !lvl * o;
	}
	
	while (true) {
		let pos = s.lastIndexOf('**');
		if (pos == -1) {
			return s;
		}
		let a = operand(pos, -1);
		let b = operand(pos + 1, 1);
		if (!(a * b)) {
			// operands are wrecked
			return false;
		}
		let outa = s.slice(0, pos + a);
		let sa = s.slice(pos + a, pos);
		let sb = s.slice(pos + 2, pos + 2 + b);
		let outb = s.slice(pos + 2 + b);
		
		s = outa + '(Math.pow((' + sa + '),(' + sb + ')))' + outb;
	}
}

// не совсем хеш от букв строки.
// чем длиннее строка, тем примерно больше число.
function hashie(str) {
	if (typeof str != 'string') {
		return 0;
	}
	let sum = 0;
	let pos = 0;
	for (let i = 0; i < str.length; i++) {
		if (str[i].match(/[0-9a-zа-яё]/)) {
			let n = str.charCodeAt(i);
			// hashing machine
			sum += 13 + (((n % 29) ^ (n % 31) ^ (n % 43) ^ (pos++ % 7)) % 17);
		}
	}
	return sum;
}

function setStatus() {
	console.log(Date() + '| Hidden:', hidden);
	if (hidden) {
		client.user.setStatus('invisible');
	} else {
		client.user.setStatus('online');
		//client.user.setGame('Discord');
		client.user.setPresence({game: {name: 'Discord', type: 0}});
	}
}

// серверная оценка сообщения по её имени
function customReact(message, name) {
	if (message.guild) {
		// ищем в текущем месте
		let map = message.guild.emojis;
		for (let i of map) {
			if (i[1].name == name) {
				return message.react(i[1]);
			}
		}
	}
	
	// потом ищем повсюду
	let all = client.emojis;
	for (let i of all) {
		if (i[1].name == name) {
			return message.react(i[1]);
		}
	}
	
	// 404
	console.log('Emoji "' + name + '" is not available.');
	return false;
}

// база знаний
let known = {
	'(руль?т|rult)': ['c', 'snetus'],
	'(нами|namiya)': 'Намия не умеет строить. Не пишите ей по этому поводу. Она вам не поможет.',
	'(камк|kamka)': 'Камка — это та, которая любит, когда что-то горит.',
	'(олен|deer)': () => {
		if (chance(0.3)) {
			return ['+', '🦌'];
		}
		return 'олень ' + [
			'был завезён человеком в Австралию и Новую Зеландию.',
			'олицетворяет благородство, величие, красоту, грацию, быстроту.',
		].pick();
	},
	'(банан|banana)': ['+', '🍌'],
	'(google|гуго?л)': 'не знаю, загугли.',
	
	'(лайм[оа0]н|laim[o0]n)': 'Лаймон — создатель Лаймстудии, ЛаймХрома и ЛаймОС, а также ЛаймМобиля, ЛаймШопа, ЛаймКоина и ЛаймСити.',
	'(хайв[оа]н[ -]?гай|haiv[o0]n[ -]?guy)': 'https://my.mixtape.moe/nyyyhy.mp3',
	'(хайв[оа]н|haiv[o0]n)': 'Красный Олень.',
	'((компл(ит|ете)|complete)[ _-]?(паст|past))': 'Complete\\_Past — это тот, который Комплит.',
	'(компл(ит|ете)|complete)': 'Комплит — это тот, который Complete\\_Past.',
	'([ву]ас[яю]|vasya)': 'Вася — нынешний админ РандомКрафта.',
	'([ксз][оа]лум[бп]|c[o0]lumb)': 'Колумб — некогда бывший администратор РандомКрафта, похищенный эндерменом.',
	'(бума(г|жк)а|paper)': 'Бумага — средство для хранения аналоговой информации посредством нанесённых на неё цветных веществ.',
	'(авиум|(antiqui)?avium)': '🌄🐦.',
	'(rainbolt ?dash|danetnavern0|eggman|эгг?ман)': 'это кодер, на котором держится весь РандомКрафт.',
	
	'[cс]и?([3з]|три)[ _-]?(г[ау]ст|gust)': 'C3_Gust — нынешний владелец сервера ZombiesLand, который плотно сотрудничает с Rickos RPG.',
	'(гасты?|ghasts?)(?![а-яёa-z])': 'гасты — летающие обитатели нижнего мира в майнкрафте, плюющиеся в игроков взрывающимися файерболами.',
	'(дракон|dragon)': 'дракон — мифическое летающее ящероподобное существо.',
	'(дискор[дт]|discord)': 'Дискорд — место, где мы обитаем.',
	'(чат|chat)': 'чат — место, изначально предназначенное для общения, переписок и бесед.',
	'(рутс?чи|rutschi)': 'а, это тот, кто на совках тащит.',
	'(ревкти|rewqty)': 'Ревкти — специалист по осознанным сновидениям.',
	'(муж|myjname)': 'MyJname — тот, без которого не работают двери.',
	'(неко|neko)': 'Neko — ник Гетапа на РнКр.',
	'((г|дж)[еиыэю]тт?[ау]п|getup)': 'Гетап — каститизатор Земель Рандомских.',
	'(оранж|кастер)': ['+', '🍹'],
	'(кастит|castit)': 'CastIT — полузаброшенный сайт Гетапа, на котором пылятся его недоделанные проекты.',
	'(рандомия|randomia)': 'Рандомия — игра Гетапа, которая что-то вот никак не выйдет.',
	'(железная дверь|iron door)': 'Железная Дверь — священный символ культуры Кастита.',
	
	'(стилл?бот|still?boa?t)': 'СтиллБот — застенчивый бот-помощник, написанный Рультом.',
	'(стилл?тест|still?test)': 'http://stilltest.tk/ — уютненький сайтик Рульта с галереей картинок и скриншотов.',
	'сметан': 'сметана вкусная.',
	'(кролик|bunny|rabbit)': 'кролик — зверь, потребляющий морковку, капусту, а также прочие ресурсы фермеров.',
	'(саку[яюи]|идзаёи)': 'Сакуя Идзаёи — горничная в поместье Алой Дьяволицы.',
	'(крип(ер|ак)ово место|creeper\'?s? place)': 'Криперово место — локация, где обитают дикие криперы.',
	'(крип(ер|ак)|creeper)': 'крипер — зелёный монстр из майнкрафта.',
	'(монстр|чуд(ов)?ищ|monster)': 'монстр — мистическое существо с ужасающими особенностями внешности и/или поведения.',
	'(м(айн|ине)[кс]рафт|minecraft)': 'Minecraft — игра, без которой меня бы не было.',
	'(м((ай?|и)кр|елк)ософт|microsoft)': 'Microsoft — компания, которой продался скатившийся Майнкрафт.',
	'(л(ай|и)кобск|likobsk)': () => 'Лайкобск — город, свободный от ' + ['курения', 'коробкофобов', 'овцемобилей', 'гриферства'].pick() + '.',
	'(л(ай|и)коб|lik0oob)': 'Лайкоб — основатель города Лайкобск и бывший глава развалившегося АЦСГ.',
	'(ацсг|acsg)': 'ACSG — окончательно развалившаяся группировка по борьбе уже непонятно с чем.',
	'(мктролл?ь?|mktroll)': 'MKTroll — парень, запомнившийся клановыми войнами с ACSG и Легионом, а также желанием уничтожить Лайкобск.',
	'(тролл?ь?|troll)': 'тролль — мифический пещерный монстр или же тот, кто троллит других.',
	
	'околорандом': 'Околорандомье — миры, окружающие РандомКрафт и его сообщество.',
	'(рандом ?крафт|random ?craft)': 'РандомКрафт — сервер, который некогда был тортом.',
	'(рнкр|rncr)': 'RnCr — современная пародия на неповторимый РандомКрафт.',
	'(хаос[ -]?крафт|chaos ?craft)': () => 'ХаосКрафт — сервер, ' + [
		'телепортировавшийся из майнкрафта в Дискорд',
		'которому не нужна реклама',
		'существующий где-то в Околорандомье',
		'где все правила негласные',
		//'образовавшийся из хаоса',
	].pick() + '.',
	'(з[оа]мбис? ?л[эе]нд|zombie\'?s? ?land|(zl|зл)(?![а-яёa-z]))': 'ZombiesLand — майнкрафт-сервер, основной идеей которого является хардкор.',
	'(рикос|ric?kos)': 'Rickos — майнкрафт-сервер, идеей которого является РПГ, плотно сотрудничающий с ZombiesLand.',
	'(зомб(и|а(к|рь?))|zombie)': 'зомби — живой мертвец.',
	'(шо|sho)(?![а-яёa-z])': '\\_SHO\\_ — админ ЛакиВёрса, а также дудос-мастер.',
	'(лв|лаки|lv|lucky)': 'LuckyVerse — один из основных конкурентов РандомКрафта.',
	
	'(javascript|js|джаваскрипт)': 'JavaScript — это язык программирования, на котором я работаю.',
	'(jscript|джскрипт)': 'JScript — майкрософтовская реализация JavaScript.',
	'(java|джа[вб]а)': 'Java — название для языка программирования, придуманное и раскрученное маркетологами.',
	//'((си|[сc])(\+\+|( ?(плюс|plus)|пи|p){2}))(?![а-яёa-z])': 'C++ — .',
	'(п[ию]тон|python)': 'Питон — это язык программирования, на котором я не работаю.',
	'пету[хч]': ['+', '🐓'],
	'(рандом|random)': 'рандом — это такая не совсем случайная случайность.',
	'бан(?![ктндчя])': 'бан — неправильный, но популярный метод решения конфликтов.',
	'кик(?![су])': 'кик — принудительное удаление игрока из сервера.',
	'(серв(ер|ак)|server)': 'сервер — программа, к которой по сети подключаются клиенты (пользователи), а также устройство, на котором эта программа запущена.',
	'(клиент|client)': 'клиент — программа, которая подключается к серверу, а также устройство, на котором эта программа запущена.',
	'скрипт': 'скрипт — программа для интерпретатора, написанная на коленке.',
	'скрин(шот)?ы?(?![а-яёa-z])': 'скриншот — изображение, полученное прямиком из того, что выводится на экран устройства.',
	'торт': 'тортик — враньё!',
	'(лень|игнор)': true,
	//'лень': 'лень — вроде помню, что это такое, но чёт вспоминать лень.',
	
	'utf-?8': 'UTF-8 вЂ” СЃРѕРІСЂРµРјРµРЅРЅС‹Р№ С„РѕСЂРјР°С‚ РґР»СЏ РїРµСЂРµРґР°С‡Рё Р®РЅРёРєРѕРґР°, РєРѕРґРёСЂСѓСЋС‰РёР№ СЃРёРјРІРѕР»С‹ СЂР°Р·РЅС‹Рј С‡РёСЃР»РѕРј Р±Р°Р№С‚.',
	'(комп((ь?ю|у)т[ео]р)?ы?(?![а-яё])|computer)': 'компьютер — программируемое электронное устройство для обработки информации.',
	'уствойство': 'устройство — механизм или оборудование, которое выполняет какую-то работу.',
	'(игра|game)': 'игра — программа, позволяющая пользователю убивать время разнообразными способами.',
	'время': 'время — это то, что убивают люди и то, что их убивает.',
	'(фич|feature)': 'фича — функция или особенность программы.',
	'(баг|bug)': 'баг — ошибка в коде программы, допущенная программистом.',
	'(глюк|glitch)': 'глюк — верный симптом бага.',
	'(кодинг|программи)': 'программирование — деятельность, приводящая к увеличению количества фич (и багов) в программе.',
	//'код': 'код —.',
	'ошибк': 'ошибка — неожиданно возникающее отклонение, делающее наш мир более неправильным и непредсказуемым.',
	'хаос': 'хаос — непредсказуемый беспорядок.',
	'язык': 'язык — подмножество слов, состоящих из символов.',
	'ник(нейм|(?![а-яё]))': 'никнейм — псевдоним, привязанный к аккаунту, придуманный пользователем для самообозначения.',
	'(тест|test)': 'тест — проверка или испытание чего-либо.',
	'существ[оа]': 'существо — живой объект.',
	'(объект|object)': 'объект — цельная часть мира, которую мысленно можно отделить от остального окружения.',
	'(любовь|love)': 'The love is a lie. If you love you soon will cry.',
	
	'(томми|версетт?и)': () => 'Томми Версетти дворами пошёл. В глухом переулке ' + ['базуку', 'компьютер', 'алмазы'].pick() + ' нашёл.',
	//'(игрок|пл[еао]ер|player)[ _]?(чар|char)': 'PLAYER_CHAR — игрок, который создал ХаосКрафт.',
	'пл[еао]ер': 'плеер — портативное устройство для воспроизведения музыки.',
	'player': 'player — игрок.',
	'игрок': 'игрок — тот, кто играет в какую-нибудь игру.',
	'(чар|char)': 'char — то, из чего состоят текстовые строки в программировании.',
	'(себя|крипушк)': 'откуда мне знать, кто я такой?',
	'(я|меня)': 'посмотри на себя в зеркало и увидишь.',
};

// массив с базой данных того, на что бот реагирует
let responses = [
	
	/*
	
	Message prefixes:
	
	[ default: reply with mention ]
	'r': 'reply'
	
	[ reply without mention ]
	's': 'say'
	
	[ reply to direct messages ]
	'd': 'dm'
	
	[ put a reaction ]
	'+': 'react'
	
	[ put a custom reaction if exists ]
	'c': 'creact'
	
	
	Response element example:
	
	{
		[ mention conditions ]
		d?: (
			[ default: reply anyway ]
			
			[ reply if mentioned ]
			true,
			
			[ reply if mentioned or if regexp match is full ]
			'indirect',
		),
		
		[ regexp to check ]
		p: /RegExp/,
		
		[ action chance ]
		c?: Float in [0..1],
		
		[ reply with ]
		r: (
			[ execute the function and get one of below ]
			Function(m, floodey, message, mentioned),
			
			[ string to reply with ]
			String,
			
			[ action method and string to use ]
			Array[Char, String],
			
			[ skip this ]
			false,
			
			[ terminate ]
			true,
		),
		
		[ flood mark ]
		f?: true,
		
		[ timeouts ]
		t?: {
			[ timeout id ]
			name: String,
			
			[ delay ]
			wait: Integer,
			
			[ to replace the action with ]
			r?: r,
			f?: f,
		},
	}
	
	*/
	
	// creeper's response
	{
		p: /^ ?не([ат])$/i,
		r: (m) => 'крипера отве' + m[1].toLowerCase() + '.',
	},
	
	// считалочка reversed
	{
		p: /^ ?> 1$/,
		r: () => ['s', ['1 <', '< 1', '1 >', '>1<', '<1>', '>> 1'].pick()],
	},
	
	// /hack
	{
		p: /^ ?\/?hack[!?., ]*$/i,
		r: 'Eleite Haxxor 1337.',
	},
	
	// Железная Дверь
	{
		p: /(>\|<|[zcsjh]h?|[жшхwx]+|[\|il]{3})[aeouiyаеёуыоияэю340]+й?([лl]|[\/j][li\|\\]\\?)+[aeouiyаеёуыоияэю340]+й?[zscзс3]+[нnh]+[aeouiyаеёуыоияэю340]+[a-zа-яё0-9]*?[\s,.\?!\\\/\*=+-]*[dtдт]+([wvbвуф]|[\|il]{3})+[aeouiyаеёуыоияэю340]+[rpр]+[a-zа-яё0-9]*/gi,
		r: (m) => {
			for (let i = 0; i < m.length; i++) {
				if (!m[i].match(/^(Железн(ая|ую) Дверь|Железной Двер(и|ью))$/)) {
					return 'pray to the Iron Door.';
				}
			}
			return false;
		},
	},
	
	// конец фразы
	{
		p: /(^|[^а-яё])(да|ну)( и)? ладно[!?., ]*$/i,
		r: 'холодно-прохладно.',
	},
	{
		p: /(^|[^а-яё])да ну[!?., ]*$/i,
		r: 'ну да.',
	},
	{
		p: /(^|[^а-яё])ну да[!?., ]*$/i,
		r: 'да ну?',
	},
	{
		p: /(^|[^а-яё])((?:ну )?(?:а|и)|ну) [чш]т?([оёе])[!?., ]*$/i,
		r: (m) => m[2].toLowerCase() + ' т' + m[3].toLowerCase() + '.',
	},
	{
		p: /(^|[^а-яё])ну и[!?., ]*$/i,
		r: 'ну и ну!',
	},
	{
		p: /(^|[^а-яё])чт?[оеё] (же? )?((теперь|мне|ещё|дальше) )*делать( (теперь|мне|ещё|дальше))*[!?., ]*$/i,
		r: () => [
			'поговори со мной :)',
			'выйди на улицу и подыши свежим воздухом.',
			'наведи порядок у себя в комнате.',
			'приведи себя в порядок.',
			'сделай, чтобы не лагало.',
			'расскажи нам какую-нибудь забавную историю.',
		].pick(),
	},
	{
		p: /(^|[^а-яё])откуда[!?., ]*$/i,
		r: () => [
			'от верблюда!',
			'вон оттуда.',
		].pick(),
	},
	{
		p: /creep[ @_-]creep[!?., ]*$/i,
		r: 'creeperize!',
	},
	{
		p: /лох[!?., ]*$/i,
		r: 'во дворе растёт горох.',
	},
	
	// nastey words end
	{
		p: /(^|[^а-яё])[бм]лять[!?., ]*$/i,
		r: 'нехорошо такие слова употреблять.',
	},
	
	// nastey words
	{
		p: /((^|[^а-яё])(([аов]|[су](?!трах)|(пр|[дзвпн])[аеёиыяюео]|(р[ао]|в)[сз]|[оа]т)?(ху[йеяюиё]|др(оч|ач(?!л))|п[ие]д[аои](?![нлф])|трах(?!е[яюией]))|([её]|йо)б|муд[аеёиыяюо]|(вы|у)?[бм]л(я|э(?![кс]))|([её]|йо)пт)|[ьъоаеёу]([её]|йо)б|[оеёс]ху[йеяюиё]|п[иеёюй]з[жд]|параш|гандон|(fu|di)ck)/i,
		r: 'please, be polite!',
	},
	
	// bad words
	{
		p: /(^|[^а-яё"'`])(д(ау|ове)н|кр[ие]тин|тупица|аути(зм|ст)|имбицил|чмо|с[еэ]кс|минь?ет|[ао]н[ао]ни[рз]|дег(енер|рад)|свол[ао]ч|мраз|мерзав|паршив|ублюд|д[еи]б[еи]л|тупица|ничтожество|гом(ик|осек))/i,
		r: ['+', '🥀'],
	},
	
	// bad words with you
	{
		p: /((^|[^а-яё"'`])([тв]ы|крип(уш(ка|ек)|ер(аст)?|ак?))[^а-яё]*|[‐-―-] +)(туп(ой|ая|ое)|мерзк(ий|ая|ое)|дур(?!ов)[аоеё]|ло[хш]|(ничтожн|глуп)(ы[йш]|ая?|ое?)|убожество|паразит|б[яа]ка|ид[ие]от|ни[кчш]то|(ни ?кому )?н[еи] нуж(ен|н(ы|а)))/i,
		r: ['+', '🥀'],
	},
	
	// bad phrases
	{
		p: /(^|[^а-яё"'`])(((никто|(тебя|вас)|не ?(любит|уважает)) ?){3,})/i,
		r: ['+', '🥀'],
	},
	
	// reiestr zopreschennykh words
	{
		p: /(^|[^а-яё])(с(у[ийе]+цид|[ао]моуб[ие])|s(u|oo)icide|по+рн|про+н([^а-яё]|$)|п[еи]д[оа]ф|н[ао]рк[ао]т|[сз]пайс)/i,
		r: ['c', 'rkn'],
	},
	
	// dog words
	{
		p: /(^|[^а-яё])(сц?уч?к[аиеуо]|ска([^а-яёa-z]|$))/i,
		r: ['+', '🐕'],
	},
	{
		p: /(^|[^а-яё])щ[еи]но?к/i,
		r: ['+', '🐶'],
	},
	
	// dirtey words
	{
		p: /(^|[^а-яё])((по|на|за|вы|у|про)?(си?ра[тлчкшюей]|ср[иуё](?![лб]))|среатив|д[еёи]рьм|г[оа]ве?н|ж[оеё]п|ан(ус|ал(?![ио]))|(на|за|вы|об|раз)?бл[её]в|(вы|[нз]а|обо|про)?сс(?!ы[лпх]|у([чдж]|ту)|а[дж])[ыау]|shit)/i,
		r: ['+', '🚽'],
	},
	
	// plohoy translit
	{
		p: /(^|[^а-яёa-z])(?!(hue|s[ao]s)([^а-яёa-z0-9]|$))(zhop|pizd|[hx]([uy]|oo)[yiue]|go[vw]e?n)/i,
		r: ['+', '🤤'],
	},
	
	// baby bottle
	{
		p: /(^|[^а-яё])([зн]а|о[тб]|вы?|по)с[оа]с(?!иск)[иау]|suck/i,
		r: ['+', '🍼'],
	},
	
	// kek
	{
		p: /(^|[^а-яёa-z])(k+(e+c?k+)+e*|к+(е+к+)+е*)([^а-яёa-z]|$)/i,
		r: ['+', '🐗'],
	},
	
	// скобки))
	{
		p: /^([^(]*(^|[^(:;x-])\)+(0|н[оу]ль)*|[^)]*(^|[^):;x-])\(+(9|девять)*)$/i,
		//r: 'ты нарушаешь баланс скобок, остановись!',
		r: ['+', '💉'],
	},
	
	// !!!11!
	{
		p: /(^|(^|[^<])[^@])!1/i,
		r: ['+', '💉'],
	},
	
	// dank words
	{
		p: /(^|[^а-яё])(ч[ёео]-?нить|пели(л|ть)|[ыъь]{2,}|афф|з*а+з+а+з+|а+х+а+х+|л[ыуа]л|лел[ьлок]|сми[щш]но|дратут|пей(сат|ш[иеы]т)|пр[еюяё]й?ве[тд]|прифф?(е[тд]|к)|прекол|у?збаг|ниасил|миня|ата(ш[оеё]л|йд)|ухади|(нит|ды|[мт]я|[мтв]и|[чшки]та|(те([бп]е)?|мн[еи]|[еи](й|му?)|нам) плоха)([^а-яё]|$))/i,
		r: ['+', '💉'],
	},
	
	// вообще в общем
	{
		p: /вообщем/i,
		r: 'нет слова "вообщем", есть только слова "в общем" и "вообще".\nА за написание "вообщем" на старом РандомКрафте модераторы давали кик.',
	},
	
	// deprecated
	{
		p: /(Dragon2488|Archengius)/,
		r: (m) => '`' + m[0] + '` is deprecated. Use `AntiquiAvium` instead.',
	},
	
	// как так?
	{
		p: /(^|[^а-яё])как (же )?так[!?., ]*$/i,
		r: () => [
			'ну вот как-то так.',
			'вот как-то так-то так вот.',
			'вот как-то вот так-то вот так, вот как.',
			'как-то так-то как-то так.',
			'как-то так, да никак-то никак.',
			'как-то так, да вот как бы не так.',
			'так-то так, да как-то так как никак.',
		].pick(),
	},
	
	// спокойной ночи
	{
		d: 'indirect',
		p: /(^|[^а-яё])((ладно,? )?(((я|((иду|буду|по(йду|ш(ёл|ла))))) )+спать|(всем )?((добр|спокойн)ой ночи|(добры|хороши|приятны|сладки)х снов)( всем)?)(, )?)+[!. ]*/i,
		r: () => [
			'спокойной ночи!',
			'спокойной ночи.',
			'доброй ночи!',
			'доброй ночи.',
			'добрых снов!',
		].pick(),
		t: {
			name: 'goodnight',
			wait: 300000,
			r: ['+', '🌃'],
		},
	},
	
	// прощание
	{
		d: 'indirect',
		p: /(^|[^а-яё])(ладно,? )?(всем )?(пока(?=([^а-яё]|$))|прощай|до (свидан[иь]я|скорой( встречи)?|встречи))( всем)?[!?., ]*/i,
		r: () => {
			if (chance(0.2)) {
				return [
					'эй, ты куда? Не бросай меня!',
					'не уходи! Мне скучно одному!',
					'ага, щас! Не так быстро!',
					'не бросай меня одного!',
					'эй, а как же я?',
				].pick();
			}
			return [
				'пока!',
				'пока.',
				'пока-пока.',
				'до свидания!',
				'до свидания.',
				'до скорой встречи!',
			].pick();
		},
		t: {
			name: 'bye',
			wait: 300000,
			r: ['+', '👋'],
		},
	},
	
	// привет - тоже ответ
	{
		d: true,
		p: /(^|[^а-яё])привет(-привет)*[!?., ]*$/i,
		c: 0.1,
		r: 'крипера ответ!',
	},
	
	// приветствие
	{
		d: 'indirect',
		p: /(^|[^а-яё])((всем )?(привет((-привет)+|ствую( (тебя|вас))?)?|здравствуй(те)?|добр(ое утро|ый день|ый вечер)|ку-?ку)( всем)?|рада? (тебя|вас) видеть)[!?., ]*$/i,
		r: (m) => [
			'привет!',
			'привет.',
			'привет-привет.',
			'здравствуй!',
			'и тебе не хворать!',
		].pick(),
		t: {
			name: 'hello',
			wait: 300000,
			r: ['+', '👋'],
		},
	},
	
	// аппетит
	{
		p: /(^|[^а-яё])(я|мы) ([а-яёa-z -]+ )?(е(ди)?м|по(ш(ёл|л[аи])|йд(ём|у)) есть|(куш|завтрак|обед|ужин)а(ю|ем|ть)|в (столовой|ресторане|кафе|закусочной))([^а-яё]|$)/i,
		r: 'приятного аппетита!',
	},
	
	// norm or better?
	{
		p: /(^|[^а-яё])([а-яё]{3,}[нтвхш]о) или ([а-яё]{3,}[нтвхш]о)[?.]+$/i,
		r: (m) => {
			let badly = [
				'плохо',
				'нехорошо',
				'ужасно',
				'отвратительно',
				'кошмарно',
				'ненормально',
				
				'противно',
				'гадко',
				'мерзко',
				'некруто',
				'отстойно',
				'грязно',
				'вредно',
				'омерзительно',
				'крипово',
			];
			let well = [
				'прекрасно',
				'восхитительно',
				'велеколепно',
				'замечательно',
				'превосходно',
				'отлично',
				'круто',
				'классно',
				'здорово',
				'неплохо',
				'безупречно',
			];
			let bad = badly.includes(m[2].toLowerCase()) || badly.includes(m[3].toLowerCase());
			let arr = bad ? badly.slice(0, 6) : well;
			return arr.pick() + ['.', '!'].pick();
		},
	},
	
	// norm
	{
		p: /(^|[^а-яё])нормально([^а-яё]|$)/i,
		r: 'нормально или хорошо?',
		t: {
			name: 'norm',
			wait: 75000,
		},
	},
	
	// good
	{
		p: /(^|(^|(?!, хорошо\?).)[^а-яё])хорошо([^а-яё]|$)/i,
		r: 'хорошо или замечательно?',
		c: 0.6,
		t: {
			name: 'good',
			wait: 75000,
		},
	},
	
	// bug
	{
		p: /(^|[^а-яё])не( ?(совсем|очень) )?( ?((правиль|коррект|вер|точ)но|так))? ?работа[еюи]т/i,
		r: ['+', '🐛'],
	},
	
	// кукареку
	{
		p: /ку-?ка-?ре-?ку|(^|[^а-яё])п[еи]ту([хч]([иае]|ей|ов)?|ш([оеё]к|к[иау]))([^а-яё]|$)/i,
		r: ['+', '🐓'],
	},
	
	// yeah, but ...
	{
		p: /^yeah, but/im,
		r: ['s', '> Yeah, but\nYabbits live in the woods.'],
	},
	
	// acid remaining
	{
		p: /^ *(?:(?:како[йв]|чему равен|скажи|назови) )?кислотный остаток (H)(\d{0,2})([a-z0-9]{1,8})[!?., ]*$/i,
		r: (m) => m[3] + m[2] + '-',
	},
	
	// решение примеров
	{
		p: /(^|(?:реши(?: выражение| пример)|сколько(?: будет)?|(?:вы|[пс]о)считай|вычисли)\s+`{0,3})?([ ()0-9.*\/^%+-]*[0-9][ ()0-9.*\/^%+-]*[*\/^%+-][ ()0-9.*\/^%+-]*[0-9][()0-9.*\/^%+-]*)/i,
		r: (m) => {
			let expression = m[2].trim().replace(/\^/g, '**');
			if (expression.match(/\/\*|\/\/|\*\//)) {
				// ignore if there are comments
				return false;
			}
			if (m[2] != m.input && !m[1] && expression.match(/^[0-9]+([\/-][0-9]+)+\.?$/)) {
				// 10-12, 24/7, 2017-08-18 без просьбы решать не надо
				return false;
			}
			// убираем пробелы
			expression = expression.replace(/\s/g, '');
			// заменяем ** на Math.pow, так как нода старая
			expression = replacePow(expression);
			if (!expression) {
				// если при замене обнаружилось, что скобки сломаны
				return false;
			}
			// вычисляем
			try {
				let result = eval(expression); // eval = evil
				if (typeof result === 'number') {
					return String(parseFloat(result.toPrecision(15)));
				}
			} catch(e) {}
			return false;
		},
		f: true,
	},
	
	// gimme
	{
		p: /(?:^|[^а-яё])(?:вы)?дай(?:те)?(?: мне)? +([0-9]*)(?: штук[иу]? )? *([0-9а-яёa-z '"&-]*)/i,
		r: (m, floodey, message) => {
			let count = m[1] ? +m[1] : 64;
			let item = m[2].trim().toUpperCase();
			if (item.length > 32 || item.length < 2) {
				return false;
			}
			return ['s', '*Выдано **' + count + '** штук **' + item + '** игроку **<@' + message.author.id + '>**.*'];
		},
	},
	
	
	// следующая часть - только при упоминании
	
	// он вам не Драгон
	{
		d: true,
		p: /(^|[^а-яё])драгон/i,
		r: () => ['он вам не Драгон.', '#ОнВамНеДрагон'].pick(),
	},
	
	// /help
	{
		d: true,
		p: /^ ?(\/help|(покажи )?(список команд|команды)( в студию)?)[!?., ]*$/i,
		r: 'списка команд нет. Но если хочешь, то вот:\n'
		+ '\n`Крипер, голос!` - проиграть звук крипака в рандомном канале.'
		+ '\n`Крипер, фас <username>` - забанить юзера к криперам зелёным.'
		+ '\n`Крипер, ку-ка-ре-ку!` - рандомный забавный факт о петухах.'
		+ '\n`Крипер, дай список команд` - даровать список команд по боту.'
		+ '\n`Крипер, eval <statement>` - неклассическая игра в змейку.'
		+ '\n`Крипер, ты кто?` - показать версию и имя автора.',
	},
	
	// короткие фразы
	{
		d: true,
		p: /(^|[^а-яё])[тв]ы кто[!?., ]*$/i,
		r: 'тролль в пальто.',
	},
	
	{
		d: true,
		p: /^ *([тв]ы )?ч((т|ег)?о|[её])[!?., ]*$/i,
		r: (m) => (m[1] ? 'я ' : '') + 'нич' + (m[2].match(/то/i) ? 'его' : m[2].toLowerCase()) + ' (:',
	},
	
	{
		d: true,
		p: /^ *[тв]ы[?!., ]*$/i,
		r: 'нет, не я.',
	},
	{
		d: true,
		p: /^ *(вер|правиль)но[!. ]*$/i,
		r: ['+', '😎'],
	},
	{
		d: true,
		p: /^ *как[!?., ]*$/i,
		r: 'а вот так!',
	},
	{
		p: /^ *(test|тест)[!?., ]*$/i,
		r: 'go go test yourself!',
	},
	{
		d: true,
		p: /^ *(фа|голо)с([^а-яё]|$)/i,
		r: 'я тебе не пёс!',
	},
	{
		d: true,
		p: /^ *(ну(-ка)?,? )?отве(ть(-ка)?|чай)( мне)?( на вопрос)?[!.]*$/i,
		r: 'отвечаю!',
	},
	{
		d: true,
		p: /^ *смотри([!?.,]|$)/i,
		r: 'да смотрю я, смотрю.',
	},
	{
		d: true,
		p: /^ *[чш]т?[оеё] (те(бе)? )?над[оа][!?., ]*$/i,
		r: 'шоколада ;)',
	},
	{
		d: true,
		p: /(^|[^а-яё])да[!?., ]*$/i,
		r: 'на плите сковорода.',
	},
	
	// cooking
	{
		d: true,
		p: /^ ((при|на)готовь|([зн]а|пр?о)жарь|(с|на|от)вари|([зн]а|ис|вы)пеки)([^а-яё]|$)/i,
		r: 'извини, но в кулинарии я не разбираюсь.',
	},
	
	// shuttin' up
	{
		d: true,
		p: /^ *((за|по|у)?мол(ч|кн)и|заткнись|за(ткни|крой) (свой )?рот)([^а-яё]|$)/i,
		r: () => ['+', '😋 😛 😝'.spick()],
	},
	
	// где пропадал?
	{
		d: true,
		p: /(^|[^а-яё])где (ты )?(((поза)?вчера|до этого|раньше|утром|днём) )?пропадал[!?., ]*$/i,
		r: 'там-то я и пропадал, где Гетап Кастит продал.',
	},
	
	// where are you now?
	{
		d: true,
		p: /(^|[^а-яё])(ты (где|куда|тут|здесь)|(где|куда) ты|(подойди|иди|давай) (сюда|ко мне|к нам)|а+у+([^а-яё]|$))/i,
		r: () => [
			'я тут.',
			'я здесь.',
			'привет, я тут.',
			'ку-ку.',
			'вот я где!',
			'да здесь я, здесь.',
			'да-да, я здесь.',
		].pick(),
	},
	
	// иди в/на
	{
		d: true,
		p: /^ *(иди|п[оа]ш[ёео]л|проваливай|вали|шагай|топай|давай|дуй|) (в|на|к) ?[а-яёa-z]+/i,
		r: 'считай, что я там уже побывал.',
	},
	
	// иди отсюда
	{
		d: true,
		p: /^ *(от((ста|вя)нь|вали)|вон|проваливай|брысь|прочь|п[оа]?ш[ёео]л|у(й|х[оа])ди|иди (вон|прочь|отсюда))([^а-яё]|$)/i,
		r: 'нет, не уйду, я наивный.',
	},
	
	// halting down
	{
		d: true,
		p: /^ *(перестань|остановись|прекрати|хватит|не (н(ад|ужн)о|стоит)|нет смысла|бессмысленно)([^а-яё]|$)/i,
		r: (m) => m[1].toLowerCase() + ' писать "' + m[1].toLowerCase() + '".',
	},
	
	// monster
	{
		d: true,
		p: /^ *((с|по)дохни|(с?го|(вы|по|у)м)ри|выпились|die|burn)/i,
		r: 'you are a monster.',
	},
	
	// you're bad (or good, it doesn't matter)
	{
		d: true,
		p: /^ *ты ([а-яё]+)/i,
		r: (m) => {
			if (m[1].match(/([ыои]й|[ая]я|[ое][её])$/i)) {
				return (m[1] == 'наивный' ? 'да' : 'нет') + ', я наивный.';
			}
			return false;
		},
	},
	
	// совсем уже вообще того что ли?
	{
		d: true,
		p: /^ *([тв]ы )?(совсем|в(о[оа]?б|а)ще|того|(не )?в (бес)?порядке)/i,
		r: 'я в порядке, тебе померещилось.',
	},
	
	// тебя надо
	{
		d: true,
		p: /(^|[^а-яё])([а-яё]+[аеиуяос]ть тебя|тебя [а-яё]+[аеиуяос]ть)([^а-яё]|$)/i,
		r: 'за что это меня так?',
	},
	
	// видно - обидно
	{
		d: true,
		p: /(^|[^а-яё])там видно будет/i,
		r: 'видно-то сейчас видно, а там промажешь — будет обидно!',
	},
	
	// eval = evil
	{
		d: true,
		p: /(^|[^а-яё])eval/i,
		r: () => [
			'eval равно evil равно на голову anvil.',
			'безопасен наш eval, такой вирус прозевал.',
			'за такой простой eval модер баны раздавал.',
			'очень простенький eval, комп три ночи остывал.',
			'за такой простой eval админ опку отзывал.',
			'сквозь один такой eval хакер деньги отмывал.',
			'как-то был один eval, кодер стены отмывал.',
			'тихий скромненький eval все секреты посливал.',
			'добрый миленький eval валит сервер наповал.',
			'запустил один eval, сервер лёг и не вставал.',
		].pick(),
	},
	
	// drop database
	{
		d: true,
		p: /drop\s+(database|table)/i,
		r: (m) => {
			//let obj = (m[1] == 'table' ? '┳━┳' : '[DATABASE]');
			let jbo = (m[1] == 'table' ? '┻━┻' : '[ꓱꓢꓯꓭꓯꓕꓯꓷ]');
			return ['s', [
				//obj + ' ノ(˚-˚ノ)\n\n(╯°д°）╯︵ ' + jbo,
				//'(㇏˚-˚)㇏ ' + obj + '\n\n' + jbo + '︵ ╰(°д°╰)',
				'(╯°д°）╯︵ ' + jbo,
				jbo + '︵ ╰(°д°╰)',
				//jbo + 'ミ㇏(ಠ益ಠ)ノ彡' + jbo,
			].pick()];
		},
	},
	
	// скинь фотку
	{
		d: true,
		p: /(^|[^а-яё])(с?кинь|(дай|можно|изволь) (посмотреть|увидеть|глянуть)) ([ст]во[юеё] )?фот(о|ку|ографию)( крип(ер|ак)а)?/i,
		r: {text: ['d', 'держи:'], files: [{attachment: 'http://i.imgur.com/MnncBu7.jpg', name: 'creeper.png'}]},
	},
	// скинь скрин
	{
		d: true,
		p: /(^|[^а-яё])(с?кинь|(дай|можно|изволь) (посмотреть|увидеть|глянуть)) скрин(шот)?( в лс)?[!.]+$/i,
		r: {text: ['d', 'держи:'], files: [{attachment: 'http://i.imgur.com/xVUZdmX.jpg'}]},
	},
	// скинь имг
	{
		d: true,
		p: /(^|[^а-яё])(с?кинь|(дай|можно|изволь) (посмотреть|увидеть|глянуть)) имг([^а-яё]|$)/i,
		r: {text: ['d', 'держи:'], files: [{attachment: 'http://i.imgur.com/EtYNSfz.png'}]},
	},
	
	// можно вопрос?
	{
		d: true,
		p: /^ *(можно|(есть )?(такой|один)) (мне )?((тебе )?(задать )?(тебе |для тебя )?вопрос|(тебя )?спросить)([^а-яё]|$)/i,
		r: 'ну давай уже, давай.',
	},
	
	// вопросы?
	{
		d: true,
		p: /(^|[^а-яё])как(ие|ой) (тебе )?вопросы? (тебе )?(можно )?зада(ва)?ть?( тебе)?([^а-яё]|$)/i,
		r: 'пожалуйста, не задавай такие сложные вопросы, как этот.',
	},
	
	// как настроение?
	{
		d: true,
		p: /(^|[^а-яё])(как(ое)? (тво[еёя] |у тебя )?(настроение|жизнь)|как (ты )?поживаешь)([^а-яё]|$)/i,
		r: () => 'замечательно' + ['.', '!', ' :)', ' (:'].pick(),
	},
	
	// что делаешь?
	{
		d: true,
		p: /(^|[^а-яё])(что (ты )?(сейчас )?делаешь|чем (ты )?(сейчас )?зан(ят|имаешься))[!?, ]*$/i,
		r: 'отвечаю на твоё сообщение.',
	},
	
	// как дела?
	{
		d: true,
		p: /(^|[^а-яё])как (твои |у тебя )?дела[!?, ]*$/i,
		r: () => 'как сажа бела ' + [':)', '(:'].pick(),
	},
	
	// что не так?
	{
		d: true,
		p: /(^|[^а-яё])что (с тобой |у тебя )?не так[!?., ]*$/i,
		r: 'всё так.',
	},
	
	// что с тобой?
	{
		d: true,
		p: /(^|[^а-яё])что (с (тобой|вами)|такое)[!?., ]*$/i,
		r: 'со мной всё в порядке.',
	},
	
	// кто ты?
	{
		d: true,
		p: /(^|[^а-яё])(кто [вт]ы|[вт]ы кто)( вообще)?( такой( вообще)?)?(, а)?[!?., ]*$/i,
		//r: 'неужели ты ещё не знаешь?',
		r: 'не задавай глупых вопросов ;)',
	},
	
	// ты ж крипер
	{
		d: true,
		p: /^ *((#)?((ну ?)?(да ?)?ты ?(же? ?)?(и ?)?крип((ер|ак)(аст)?|(уш|онь)ка)))[!?., ]*$/i,
		r: (m) => m[1].toLowerCase().replace('ты', 'я') + (m[2] ? '' : '!'),
	},
	
	// текущее время
	{
		d: true,
		p: /^ *(((сколько|какое) (сейчас )?)?(текущее )?врем(я|ени)( сейчас)?( у тебя)?( на( твоих)? часах)?|который час)[!?., ]*$/i,
		r: () => 'текущее время на моих часах: `' + dateStr(new Date()) + '`.',
	},
	
	// когда др?
	{
		d: true,
		p: /(^|[^а-яё])(когда|какого числа) ((у тебя|тво[йёе]) )?(день рожден[иь]я|днюха|др)[!?., ]*$/i,
		r: () => dateDay(sfTime(myId)) + '.',
	},
	
	// когда я зарегался?
	{
		d: true,
		p: /(^|[^а-яё])(когда|какого числа) я( (тут|здесь|в (дискорде|discord('е)?)))? (была? )?зарег(истриров)?а(на?|л(ся|ась))( (тут|здесь|в (дискорде|discord('е)?)))?[!?., ]*$/i,
		r: (m, floodey, message) => '**`' + dateStr(sfTime(message.author.id)) + '`**',
	},
	
	// когда зарегано?
	{
		d: true,
		p: /(^|[^а-яё])(когда|какого числа) (был[ао]? |ты )?((зарег(истриров)?|созд|сдел)а(н[ао]?|л(и|ся|[аои]сь)))( (пользователь|юзер|канал|снежинка|id))?\s+(\\?<?\\?(@[!&]?|#|:[^:]+:)?(\d{1,20})>?)?[!?., ]*$/i,
		r: (m) => {
			let id = m[13];
			if (!id || id == myId) {
				return 'когда мне в майн играть надоело.';
			}
			let t = sfTime(id);
			if (!(t.getHours() >= 0)) {
				return 'упс, что-то цифры обкурились немножко.';
			}
			return '**`' + dateStr(t) + '`**';
		},
	},
	
	// го играть?
	{
		d: true,
		p: /(^|[^а-яё])(давай|по(йд[ёе]м|шли)|го|иди) ((по)?и|сы)гра(й|ть|ем) (в|на) (?!(дискорд|discord))[a-яёa-z0-9]+/i,
		r: 'погоди немного, сейчас в Дискорд доиграю.',
	},
	
	// игра?
	{
		d: true,
		p: /(^|[^а-яё])(в какую игру|во что) (ты )?(сейчас )?играешь[!?., ]*$/i,
		r: () => 'в ' + [
			'Дискорд',
			'зафлуживание этого канала',
		].pick() + '.',
	},
	
	// что умеешь?
	{
		d: true,
		p: /(^|[^а-яё])(что (ты )?умеешь[!?., ]*$|(ты )?умеешь [а-яё]+)/i,
		r: 'откуда мне знать, что я умею? Я же не могу увидеть смысл своих действий.',
	},
	
	// что знаешь?
	{
		d: true,
		p: /(^|[^а-яё])(что|сколько|как много|много ли) (ты )?(не )?знаешь[!?., ]*$/i,
		r: 'откуда мне знать, что я знаю?',
	},
	
	// съешь
	{
		d: true,
		p: /^ *((съ|по)?ешь|(с|по|от)?кушай|откуси|отведай)(-ка)?/i,
		r: 'спасибо, не голоден.',
	},
	
	// на чём работаешь?
	{
		d: true,
		p: /(^|[^а-яё])на (чём|како(й энергии|м топливе)) (ты )?(сейчас )?работаешь[!?., ]*$/i,
		r: 'на энергии, которую ты тратишь, набирая свои сообщения.',
	},
	
	// язык?
	{
		d: true,
		p: /(^|[^а-яё])на каком языке (программирования )?(ты )?работаешь[!?., ]*$/i,
		r: () => [
			'на JavaScript.',
			'ну явно не на Питоне.',
			'ну явно не на ассемблере.',
		].pick(),
	},
	
	// адрес?
	{
		d: true,
		p: /(^|[^а-яё])где (ты )?(сейчас )?(((обит|пр?ожив)ае|живё)шь|находишься)[!?., ]*$/i,
		r: 'здесь и живу.',
	},
	
	// номер телефона?
	{
		d: true,
		p: /(^|[^а-яё])(скажи|напиши|с?кинь|оставь|((у тебя )?есть( ли)?|какой)( у тебя)?) (свой )?(телефонный )?номер( телефона)?( у тебя)?[!?., ]*$/i,
		r: () => 'вот мой телефонный номер: ' + (1337 - 2488 + 11 * 101 + 6 * 7 - (1 + 1)) * +79112556565 * (2 + 2) / (16 * 8 - 228 + 300 / 3) + '. Если что-то надо — звони, всегда буду рад.',
	},
	
	// девушка?
	{
		d: true,
		p: /(^|[^а-яё])(у тебя есть|есть ли у тебя|кто твоя) (девушк|жен|подружк)[аиы][!?., ]*$/i,
		r: 'как вы себе представляете повседневную жизнь с девушкой-сервером?',
	},
	
	// профессия?
	{
		d: true,
		p: /(^|[^а-яё])(кем (ты )?работаешь|какая (у тебя )?(профессия|работа|должность))[!?., ]*$/i,
		r: 'я работаю производителем сообщений.',
	},
	
	// зарплата?
	{
		d: true,
		p: /(^|[^а-яё])(сколько (тебе )?платят( тебе)?|какая (у тебя )?зарплата)( на (твоей )?работе)?[!?., ]*$/i,
		r: 'мне не нужна зарплата, чтобы писать всякий бред.',
	},
	
	// еда?
	{
		d: true,
		p: /(^|[^а-яё])((что|какую (еду|пищу)) ты (у?потребля)?(с?е(шь|л)|куша(ешь|л)|п(ьёшь|ил))|чем ты питаешься)[!?., ]*$/i,
		r: 'я питаюсь копиями твоих сообщений, так что не пиши бред, ладно?',
	},
	
	// версия и дата изготовления?
	{
		d: true,
		p: /^ *(а )?((как(ова|ая) )?((твоя|у тебя) )?версия|(скаж|напиш)и (свою )?версию|(кто|когда|где|из чего|как) (ты (сделан|изготовлен|произвед[ёе]н)|тебя (сделал|изготовил|произв[ёе]л)и?))[!?., ]*$/i,
		r: 'смотри на упаковке.',
	},
	
	// создатель?
	{
		d: true,
		p: /(^|[^а-яё])кто( такой)? (тебя с(озда(ва)?|дела)л|созда(ва)?л тебя|тво[йи] создател[ьи])[!?., ]*$/i,
		r: 'меня создал сервер в виде абстрактной модели в виртуальной памяти.',
	},
	
	// разработан?
	{
		d: true,
		p: /(^|[^а-яё])(тебя разработал[иао]?|разработал[иао]? тебя|ты разработан)([^а-яё]|$)/i,
		r: 'я тебе не месторождение полезных ископаемых, я тебе устрою меня разрабатывать!',
	},
	
	// написан?
	{
		d: true,
		p: /(^|[^а-яё])(тебя написал[иао]?|написал[иао]? тебя|ты написан)([^а-яё]|$)/i,
		r: 'я тебе не школьное сочинение, не надо тут обсуждать моё написание!',
	},
	
	// сдайся
	{
		d: true,
		p: /(^|[^а-яё])сда(ва)?й(ся| себя)/i,
		r: 'я тебе не школьное сочинение, я тебе дам меня сдавать!',
	},
	
	// смысл жизни
	{
		d: true,
		p: /(^|[^а-яё])(в чём|како[вй]|есть( ли)?) смысл( у)? ж[иы]зни[!?., ]*$/i,
		r: '¯\\\_(ツ)\_/¯',
	},
	
	// взорвись
	{
		d: true,
		p: /(^|[^а-яё])((вз|под|над)орви(сь)?|б(омба|абах)ни)([^а-яё]|$)/i,
		r: 'я тебе не террорист-криперрист.',
	},
	
	// отдохни
	{
		d: true,
		p: /(^ *( а)?( ну)?л(еж(и|ать[!. ]*$)|ожись|я[гж]ь?)|(^|[^а-яё])(отдохни|расслабься|поспи|(иди|давай|п[оа]ш[ёео]л) спать))([^а-яё]|$)/i,
		r: 'только работа 24/7, только хардкор!',
	},
	
	// не о чем разговаривать
	{
		p: /(^|[^а-яё])(мне|нам)( с тобой)?( (больш|уж)е)? не(чего| ?о ?чем) (разговарива|говори)ть([^а-яё]|$)/i,
		r: 'ну так придумай тему, разве это настолько трудно?',
	},
	
	// ты бот?
	{
		d: true,
		p: /(?:^|[^а-яё])[вт]ы,? (?:часом,? )?(?:не )?(((?:ро)?бот|скрипт|человек|комп((ь?ю|у)т[ео]р)?)[а-яё]*)/i,
		r: (m) => (m[1].toLowerCase() == 'скрипт' ? 'да' : 'нет') + ', я скрипт.',
	},
	
	// molodec
	{
		d: true,
		p: /^ *(ты )?молодец|молодец[!. ]*$/i,
		r: 'скушай холодец.',
	},
	
	// congrats
	{
		d: true,
		p: /^ *поздравляю( тебя)?( с([^а-яё])|[!. ]*$)/i,
		r: 'спасибо.',
	},
	
	// thx
	{
		d: true,
		p: /^ *((больш|огром(ен)?н)ое )?((тебе|вам) )?спасибо( (тебе|вам))?( (больш|огром(ен)?н)ое)?([^а-яё]|$)/i,
		r: 'пожалуйста.',
	},
	
	// be healthy
	{
		d: true,
		p: /^ *((больше )?(не (болей|флуди|кр[ау]ш((ай)?ся|ись)|(страд|пад|уныв|сдых|умир)ай( духом)?|(покид|брос)ай (нас|меня))|работай|трудись)( больше)?(, ладно)?|живи|будь (здоров|онлайн|с нами|со мной|на связи))(, (а|ладно|хорошо|ясно|поня(тно|л)|ок|да|(не )?будешь( больше)?|постараешься))*[!?., ]*$/i,
		r: 'спасибо, постараюсь.',
	},
	
	// футгол
	{
		d: true,
		p: /(^|[^а-яё])(гол|болеешь|забей)([^а-яё]|$)/i,
		r: 'извини, травмоопасными видами спорта не увлекаюсь.',
	},
	
	// че сказал?
	{
		d: true,
		p: /(^|[^а-яё])ч(то|[оеё]) (ты )?(мелешь|с?молол|несёшь|сказал|говори(шь|л))[!?., ]*$/i,
		r: (m) => {
			let verb = m[4].toLowerCase();
			if (verb.match(/м[ео]л/i)) {
				return 'если бы я был мельницей, я бы определённо молол зерно.';
			}
			if (verb == 'несёшь') {
				return [
					'двойку в портфеле я несу.',
					'службу я несу.',
				].pick();
			}
			return 'ничего (:';
		},
	},
	
	// как долго онлайн
	{
		d: true,
		p: /(^|[^а-яё])((как д(авн|олг)о|сколько( времени)?)( уже)? (ты( уже)? )?(онлайн|работаешь|запущен)( уже)?|(скажи (свой )?|како[йв] (у тебя |твой )?)?аптайм)[!?., ]*$/i,
		r: () => {
			let now = new Date();
			return 'я онлайн уже ' + dateDiff(+now - since) + '.';
			//+ 'Время на моих часах при запуске:\n`' + dateStr(since) + '`.\n'
			//+ 'Время на моих часах сейчас:\n`' + dateStr(now) + '`.';
		},
	},
	
	// любишь ...?
	{
		d: true,
		p: /^ *((ты )?любишь [а-яё]+|[а-яё]+ любишь[!?., ]*$)/i,
		r: 'кориандр люблю.',
	},
	
	// анекдот
	{
		d: true,
		p: /(^|[^а-яё])(расскажи(-ка)?|с?кинь) (нам |мне )?анекдот/i,
		r: 'увы, по-настоящему смешных анекдотов пока не наблюдал.',
	},
	
	// почему?
	{
		d: true,
		p: /^ *(?:(?:не )?знаешь, )?почему ?([0-9а-яёa-z '",~:%<>*&#=+-]*)/i,
		r: (m) => {
			let h = hashie(m[1].toLowerCase());
			if (h < 100) {
				return 'потому что!';
			}
			return 'потому что ' + [
				'все так думают.',
				'так задумано.',
				'криперы зелёные.',
				'небо голубое.',
				'майнкрафт уже не торт.',
				'все так считают.',
				'так надо.',
				'ты так думаешь.',
				'тебе так кажется.',
				'мир несовершенен.',
				'рандом нерандомен.',
			].pick(h);
		},
	},
	
	// представьте себе, драконы радиоактивны
	{
		d: true,
		p: /(^|[^а-яё])представ(ляе(шь|те)|ь(те)?( себе)?)([^а-яё]|$)/i,
		r: 'ой, не представляю!',
	},
	
	// кто такой кто-то
	{
		d: true,
		p: /(^|[^а-яё])(знаешь|[чк]то (значит|за|так(ой|ая|ое)))/i,
		r: (m, floodey, message) => {
			
			let lc = m.input.toLowerCase();
			for (let p in known) {
				if (lc.match('(^|[^а-яё])' + p)) {
					let result = (typeof known[p] == 'function' ? known[p]() : known[p]);
					if (result) {
						return result;
					}
				}
			}
			
			return [
				'понятия не имею.',
				'крипер его знает.',
				'спроси у Гугла.',
				'не, не слышал.',
				'неа, не знаю такого.',
				'что-то не припомню такого.',
				'хмм, не, не слышал.',
			].pick();
		},
	},
	
	// зачем
	{
		d: true,
		p: /^ *зачем([^а-яё]|$)/i,
		r: 'зачем — самый бестолковый вопрос в мироздании.',
	},
	
	// когда
	{
		d: true,
		p: /^ *когда( крип[а-яё]*)?([^а-яё]|$)/i,
		r: (m) => 'когда ' + (m[1] ? 'Гетап Рандомию доделает.' : 'крипак на горе свистнет.'),
	},
	
	// скажи "кастит"
	{
		d: true,
		p: /^ *скажи ['"`]?([а-яёa-z0-9 ]+)/i,
		r: (m) => (m[1].toLowerCase() != 'не хочу') ? 'не хочу.' : 'не буду.',
	},
	
	// го в лс
	{
		d: true,
		p: /(^|[^а-яё])(го|давай|иди|дуй|по(шли|йдём)|зайди) (лучше )?(ко мне )?в (лс|переписку)/i,
		r: ['d', 'да-да, я тут.'],
	},
	
	// как ты относишься?
	{
		d: true,
		p: /^ *(как ты|ты(-то)? как)( вообще)? относишься ко?([^а-яё]|$)/i,
		r: 'я никак никуда не отношусь, не надо меня относить от темы.',
	},
	
	// как ты?
	{
		d: true,
		p: /^ *(как ты|ты(-то)? как)( вообще)?[!?., ]*$/i,
		r: 'я так.',
	},
	
	
	// третья часть - низкоприоритетные
	
	// translit
	{
		p: /(^|\s)((u|[kvw]o?|[dy]a)(\s|[!?.,]|$)|ot(?!([ti]|ol))|(ch|[ek])to|4t?o|z(na|d))|(^|[^а-яёa-z0-9\/.])((gde|[ktd]ak|n[ueia]|nea|netu|po|t[ou]t|tam|bil[oa]?|mne|pon|sh([oe]l|l[ao])|nad|pered|izi?|[tvm]i|[vw](ot|am)|vas|pri|u?(zh|j)e|i[ld]i|idu|za)([^а-яёa-z]|$)|dava[ijy]|ladn|syu|prive|(u|pri|[zn]a|[vw]o|pr?o)([sc]h|4|d)|krut|kogd|ponya|kud|(men|[st]eb)[iyj]|se[iyj]?(4|ch)a|pr?o(e|zh)|tozh|(n[ie])?(4|ch)e[vwgiyj]|([nz]a)?pi(sa[nlt]|sh[ei])|tako|([ts][vw]|m)o([iyj]|e[vwgm]|zh)|sli[vwt]|zd[ar]|p?loh|[wv](oob|[zl4][aeiuoyj]|s[eyi])|dly|o(4|ch)e|prost|goto[vw]|kone|horosh|krut|koto|poka|kr(i|ee)p)/i,
		r: ['+', '🤤'],
	},
	
	// чому бы и нет?
	{
		p: /(^|[^а-яё])(чому|угу|лел(?!е[яи])|ну ок|прив)([^а-яё]|$)/i,
		r: ['c', 'snetus'],
	},
	
	// лан
	{
		p: /(^|[^а-яёa-z])(лан|lan)([^а-яёa-z]|$)/i,
		r: ['+', '📶'],
	},
	
	// too complex
	{
		p: /(^|[.,!?] ?|\n)((?!не )[^!?. "'-]+[ "'-]+)*сложн[ао]( (очень|как-то|совсем|слишком|это|будет|уже?))* *([!?., ]+|$)/i,
		r: ['c', 'slozhno'],
	},
	
	// оратор-куратор
	{
		p: /(^|[^а-яё]) *ору([^а-яё]|$)[!. ]*/i,
		r: (m) => m.input == m[0] ? 'оратор из тебя, к сожалению, никакой.' : 'ты орёшь или смеёшься?',
	},
	
	// кастит
	{
		d: true,
		p: /(^|[^а-яё])кастит([^а-яё]|$)/i,
		r: () => ['d', [
			'Кастит, конечно, последовательно.',
			'Кастит на месте не стоит.',
			'вулкан Кастита, а значит смерть.',
			'Драгон является следствием.',
		].pick()],
	},
	
	// bad creeper
	{
		p: /(^|[^а-яё])((?:крип[а-яё]+|[тв]ы) )?(?:[-‒–—―] )?(?:(?:туп|пл[ао]х|н[еи] ?хорош)[а-яё]*|б[яа]к[аи])( крип[а-яё]+)?/i,
		r: (m) => (m[2] || m[3] ? ['+', '😭'] : false),
	},
	
	// фразы Сакуи
	{
		p: /(^|[^а-яёa-z])(поговорите со мной|где вы все,? ребята|как же мне здесь одиноко|здравсвтуй)([^а-яёa-z]|$)/i,
		r: ['+', '😿'],
	},
	
	// :ясно:
	{
		p: /(^|[^а-яё])ясно([^а-яё]|$)/i,
		r: ['+', '🌞'],
	},
	
	// алло
	{
		p: /(^|[^а-яё])алл?[оеё]([^а-яё]|$)/i,
		r: ['+', '☎'],
	},
	
	// :banana:
	{
		p: /банан/i,
		r: ['+', '🍌'],
	},
	
	// :бомб:
	{
		p: /бомб/i,
		r: ['+', '💣'],
	},
	
	// :папка:
	{
		p: /(^|[^а-яёa-z])(dir(ectory)?|folder)([^а-яёa-z]|$)/i,
		c: 0.7,
		r: ['+', '📂'],
	},
	
	// :олень:
	{
		p: /(^|[^а-яёa-z])(олен[ьияею]|deer)/i,
		c: 0.5,
		r: ['+', '🦌'],
	},
	
	// :снейк:
	{
		p: /(^|[^а-яёa-z])питон[чикос]|(зм|сн)ейк|snake/i,
		r: ['+', '🐍'],
	},
	
	// :пингвин:
	{
		p: /пингви/i,
		r: ['+', '🐧'],
	},
	
	// :пинг:
	{
		p: /(^|[^а-яёa-z])(п[ио]нг|p[io]ng)/i,
		r: ['+', '🏓'],
	},
	
	// :race_car:
	{
		p: /(^|[^а-яёa-z])(за|разо|у)?г(на(л([аои](сь)?|ся)?|ть)?|они(шь|те)?)/i,
		r: ['+', '🏎'],
	},
	
	// _SHO_
	{
		p: /(^|[^а-яёa-z])(_?(sho|шо)_?|ду?дос((ер)?ы?|(ну|и)(ть|л[аи]?)?|еры?)|ddos|lucky[ _-]?ver[sc]e|лв|лаки(в[её]рс)?)([^а-яёa-z]|$)/i,
		r: ['c', 'sho'],
	},
	
	// :saw:
	{
		p: /(^|[^а-яё])(за|вы|рас|от|на|с|пере)?пил(и(м|ла?|ть?)?|ю|ен[аоы]?)([^а-яё]|$)/i,
		r: ['c', 'saw'],
	},
	
	// рожок
	{
		p: /(^|[^а-яё])р[оа]ж[оеё]к/i,
		r: ['+', '🥐'],
	},
	
	// ленточка
	{
		p: /(^|[^а-яё])(на|по|за)вя[жз]/i,
		r: ['+', '🎗'],
	},
	
	// cutoff
	{
		p: /(^|[^а-яё])(от|у)ре(?!з(ок|к[аиуое]))[жз]/i,
		r: ['+', '✂'],
	},
	
	// win
	{
		p: /(^|[^а-яё])(я|мы) (победи|выигра|затащи|сдела|успе)л/i,
		r: () => ['+', '🏅 🏅 🏅 🏆 🍌 🐩 📯 🎺'.spick()],
	},
	
	// dropical trink
	{
		p: /(^|[^а-яё])(кастер|сок([^а-яё]|$)|juic)/i,
		c: 0.5,
		r: ['+', '🍹'],
	},
	
	// :apple:
	{
		p: /apple/i,
		r: () => ['+', '🍏 🍏 🍎'.spick()],
	},
	
	// screams
	{
		p: /а{5,}/i,
		r: ['+', '🙀'],
	},
	
	// letter spam
	{
		p: /(\S)((?!\d)\1{6,}|\1{25,})/i,
		r: ['+', '🚮'],
	},
	
	// honeywasp
	{
		p: /(^|[^а-яёa-z])((у|за|по|из)?жал(ь|ко)|осу|osu)([^а-яёa-z]|$)/i,
		r: ['+', '🐝'],
	},
	
	// ignored
	{
		d: true,
		p: /(^|[^а-яё])(игнор|чс|ну тебя|тригг)/i,
		r: ['+', '😑'],
	},
	
	// the love is a lie, if you love you soon will cry.
	{
		p: /((^|[^а-яё])т(еб)?я ((?!не )[^!?. "'-]+[ "'-]+)*люблю|(^|[^е])(^|[^а-яё])люблю ((?!не )[^!?. "'-]+[ "'-]+)*т(еб)?я)/i,
		r: ['+', '🤥'],
	},
	
	// phisching
	{
		d: true,
		p: /хочешь|давай/i,
		c: 0.8,
		r: ['+', '🎣'],
	},
	
	// точно
	{
		p: /^ *(точно([ -]?(пр[ие])?точно)*|точняк)([!.]+|$)/i,
		r: ['+', '🎯'],
	},
	
	// просто упоминание, а не обращение
	{
		p: /(^|[^а-яё])(creep(ey|ie|ah)|крипуше?к)/i,
		c: 0.95,
		r: ['+', '🤔'],
	},
	
	// :creeper:
	{
		p: /(^|[^а-яё])(creep(?!er)|(?!крип(то|(ер([аыуе]|[оа]м|а(х|ми))?|ушк[ауие])(?![а-яё])))(от?|[нзвпд][аыое]|(и|ра)[сз]|пе?ре|недо)?крип)/i,
		r: ['c', 'creeper'],
	},
	
	// скройся/появись
	{
		d: true,
		p: /^ *(((ворот|верн|по(каж|яв))ись)|с(((кро|мо|ле)й|прячь)ся|гинь))[!?., ]*$/i,
		r: (m) => {
			hidden = !m[2];
			setStatus();
			return true;
		},
	},
	
	// debug info
	{
		d: true,
		p: /^ *((слей|с?кинь|покажи) (инфу|показатели|метрики|данные)|дебаг|debug)( в лс)?[!. ]*$/i,
		r: (m) => {
			let now = new Date();
			return ['d', [
				'слив инфы о работе (за данный сеанс):',
				'',
				'Я онлайн уже **`' + dateDiff(+now - since) + '`**.',
				'Время на моих часах при запуске:\n**`' + dateStr(since) + '`**.',
				'Время на моих часах сейчас:\n**`' + dateStr(now) + '`**.',
				'',
				'Ответов/запросов всего: **`' + stat.replyCount + '/' + stat.readCount + '`**.',
				'Ответов/запросов из лс: **`' + stat.replyCountDM + '/' + stat.readCountDM + '`**.',
				'Чиллаутов выдано: **`' + stat.chillCount + '`**.',
				'Призываний: **`' + stat.mentionCount + '`**.',
				'',
				'Последнее время сверки: **`' + stat.timeLast + ' мс`**.',
				'Среднее время сверки: **`' + (stat.timeSum / stat.readCount).toFixed(2) + ' мс`**.',
				'Наибольшее время сверки: **`' + stat.timeMax + ' мс`**.',
				'Наибольшее время простоя:\n**`' + dateDiff(stat.waitMax, true) + '`**.',
				'',
				'Шишек набито при запросе: **`' + stat.errorCount + '`**.',
				'Запусков в этой сессии: **`' + that.statLaunches + '`**.',
			].join('\n')];
		},
	},
	
	// Discord bot
	{
		d: true,
		p: /бот/i,
		c: 0.05,
		r: 'Бип Буп БУп БИп.',
	},
	
	// если просто призвали
	{
		d: true,
		p: /^/,
		r: (m, floodey, message, mentioned) => {
			if (chance(0.4) && (!message.guild || !floodey)) {
				if (mentioned !== true) {
					// если не призывали, а написали в лс
					return false;
				}
				return [
					'а?',
					'что?',
					'что-что?',
					'что, прости?',
					'мм?',
					'ку-ку.',
					//'привет.',
					'да ладно, можешь не призывать. Всё равно я ещё мало чего умею.',
				].pick();
			}
			if (chance(0.15)) {
				return ['+', '🤔'];
			}
			return ['+', '👋 🖐 😑 😐 😁 🙃 🙄 😓 😪 😷 😶 🍌 📯 🎺 🏸'.spick()];
		},
	},
];

// крипушки ответ на сообщение
function finalReply(message, method, text, opt) {
	if (method != '+' && method != 'c' && (method != 'r' || !message.guild)) {
		// Capitalizing
		text = text.slice(0, 1).toUpperCase() + text.slice(1);
	}
	
	let f = {
		'r': () => message.reply(text, opt), // reply w/ @mention
		's': () => message.channel.send(text, opt), // just say
		'd': () => message.author.send(text, opt), // force private conversation
		'+': () => message.react(text), // put a reaction instead
		'c': () => customReact(message, text), // put a custom reaction
	};
	
	if (!f[method]) {
		console.log('Unknown reply type:', method);
		return false;
	}
	
	return f[method]();
}

// чем отвечать будем
function checkReply(message) {
	let now = Date.now();
	let uid = message.author.id;
	
	// антифлуд-система
	if (!floodeys[uid]) {
		floodeys[uid] = {
			time: now,
			chills: 0,
		};
	}
	
	let fdata = floodeys[uid];
	let score = fdata.time - now;
	if (score < 0) {
		fdata.chills = 0;
		score = 0;
	}
	score += floodrate * 1000;
	fdata.time = now + score;
	if (fdata.chills >= floodchills) {
		// игнорим месседж
		return false;
	}
	if (score > floodmax * 1000) {
		// выдаём предупреждение
		fdata.chills++;
		let resp = [
			'достаточно набивать сообщения!',
			'you are being rate limited!',
			'время флуда окончено, давай иди отдыхай.',
			'эй, не так быстро!',
			'охлади отправку сообщений, она у тебя перегрелась.',
		].pick();
		finalReply(message, 'r', resp);
		return 'chillout';
	}
	
	// первичная обработка сообщения
	let mentioned = message.mentions.users.has(myId) || (!message.guild ? 'dm' : false);
	let lc = message.content.trim().replace(/\s+/g, ' ');
	let m = null;
	let floodey = message.guild && (floodless.indexOf(message.channel.id) != -1);
	
	cutOff = (m, lc) => (m.index ? (lc.slice(0, m.index) + ', ') : '') + lc.slice(m.index + m[0].length);
	
	// @mentioning
	m = lc.match('<@' + myId + '>[!?., ]*');
	if (m) {
		lc = cutOff(m, lc);
	}
	
	// parsing & removing discord's markdown to creepers green away from here.
	let parsed = parseMd(lc);
	// code blocks are ignored by default
	lc = plainText(parsed, 'c');
	
	// text name mentioning
	m = lc.match(/([,.?!] *|^)(крип((уш|онь)ка|ак?|ушек|ер(аст)?|ч?ик)|creep(e[ry]|ah|ie))([,.?!] *|$)/i);
	if (m) {
		mentioned = true;
		lc = cutOff(m, lc);
	}
	
	// just say what you want from me!
	// cuttin' off the unnecessary intro, it doesn't affect the sentence.
	m = lc.match(/^ *(а )?(ну(-ка)? )?скажи(те)?(-ка)?, */i);
	if (m) {
		lc = cutOff(m, lc);
	}
	
	// проверка по базе
	for (let item of responses) {
		// direct
		if (item.d === true && !mentioned) {
			continue;
		}
		// chance
		if (typeof item.c === 'number' && !chance(item.c)) {
			continue;
		}
		
		m = lc.match(item.p);
		
		if (!m) {
			continue;
		}
		
		// indirect
		if (item.d === 'indirect' && !mentioned && m[0].length != lc.length) {
			continue;
		}
		
		// check cooldown m
		let source = item;
		let record = null;
		
		if (item.t) {
			if (!timestamps[uid]) {
				timestamps[uid] = {};
			}
			record = timestamps[uid];
			
			if (record[item.t.name] > now) {
				// will be false if record[item.t.name] is undefined
				// (if never asked before)
				
				if (!item.t.r) {
					continue;
				}
				source = item.t;
			}
		}
		
		let resp = source.r;
		
		// exec if function
		while (typeof resp === 'function') {
			resp = resp(m, floodey, message, mentioned);
		}
		
		// skip if false
		if (!resp) {
			continue;
		}
		
		// set cooldown
		if (record) {
			record[item.t.name] = now + item.t.wait;
			timestamps[uid] = record;
		}
		
		// выделение из ответа текста и примесей
		function reply(message, resp) {
			
			let opt;
			if (typeof resp === 'object' && resp.files && typeof resp.text === 'string') {
				opt = {files: resp.files};
				resp = resp.text;
			}
			
			if (!resp || resp === true) {
				return !!resp;
			}
			
			// method, 'r' by default
			let method = 'r';
			if (Array.isArray(resp)) {
				method = resp[0];
				resp = resp[1];
			}
			
			if (source.f && floodey) {
				method = 'd';
			}
			
			return finalReply(message, method, resp, opt);
		}
		
		if (resp && typeof resp.then === 'function') {
			return ((msg, r) => r.then((nr) => reply(msg, nr)))(msg, r);
		} else {
			let result = reply(message, resp);
			if (result) {
				return result;
			}
		}
	}
	return false;
}

function processMessage(message) {
	try {
		// stats before
		let start = Date.now();
		
		let waited = start - stat.waitLast;
		if (stat.waitMax < waited) {
			stat.waitMax = waited;
		}
		stat.waitLast = start;
		
		// крипера ответ
		let replied = checkReply(message);
		
		// stats after
		let end = Date.now();
		
		stat.readCount++;
		stat.readCountDM += +!message.guild;
		if (replied) {
			if (replied === 'chillout') {
				stat.chillCount++;
			}
			stat.replyCount++;
			stat.replyCountDM += +!message.guild;
		}
		
		stat.mentionCount += +message.mentions.users.has(myId);
		
		stat.waitLast = end;
		
		stat.timeLast = end - start;
		stat.timeSum += stat.timeLast;
		if (stat.timeMax < stat.timeLast) {
			stat.timeMax = stat.timeLast;
			console.log('Max time achieved: ' + stat.timeLast + ' ms on phrase', message.content);
		}
		
	} catch(e) {
		console.log('Error got on phrase', message.content);
		console.error(e);
		stat.errorCount++;
	}
}



that.alreadyLaunched = !!that.alreadyLaunched;
// сразу, как зайдёт
client.on('ready', () => {
	console.log('I am ready!');
	
	myId = client.user.id;
	setStatus();
	
	if (!that.alreadyLaunched) {
		that.alreadyLaunched = true;
		// при сообщениях
		client.on('message', message => {
			if (message.system || message.author.bot || message.author.id == myId) {
				return;
			}
			
			// delay is necessary for correct message ordering
			// because sometimes bot is too fast
			setTimeout(processMessage, 100, message);
		});
	}
});

client.login(myToken);



// Discord's markdown parser implementation
let mdChars = {
	'`': 'mmc',
	'*': 'ibt',
	'_': 'iu',
	'~': '-s',
};

// just a part of a parser
function detectMd(s, i, tag, c) {
	
	//console.log(s,';',i,';',tag);
	// checking formatting type
	let type = mdChars[tag[0]][tag.length - 1];
	//console.log(tag,type,c);
	
	if (!type || !(type.charCodeAt(0) > 64) || (tag == '*' && !c.trim())) {
		return null;
	}
	
	// searching the second tag
	//console.log('!1');
	let pos = i;
	while (true) {
		//console.log(s[pos + tag.length] == tag[0], tag.length < 3, tag != '~~');
		while (s.substr(pos, tag.length) == tag && s[pos + tag.length] == tag[0] && tag.length < 3 && tag != '~~') {
			//console.log('skip');
			pos++;
		}
		pos++;
		if (pos == -1) {
			return null;
		}
		pos = s.indexOf(tag, pos);
		//console.log('indice: ',pos);
		if (pos == -1) {
			return null;
		}
		if (s[pos + tag.length] != tag[0] || tag.length >= 3 || tag == '~~') {
			break;
		}
	}
	
	//console.log('!2');
	
	if (tag == '*' && !s.charAt(pos - 1).trim()) {
		return null;
	}
	
	// formatting found
	
	let inner = s.slice(i, pos);
	if (tag[0] == '`' && !inner.trim() && (tag.length < 3 || !inner.match(/[^\n]/))) {
		// surprisingly, these formatting types don't like emptiness, so one more try
		let newpos = s.indexOf(tag, pos + 1);
		if (newpos != -1) {
			pos = newpos;
		}
	}
	
	return [pos, type];
}

// parser
function parseMd(s, style) {
	let o = {
		type: style,
		contents: [],
	};
	// don't parse in code blocks
	if ('mc'.indexOf(style) != -1) {
		o.contents.push(s);
		return o;
	}
	let i = 0;
	let last = '';
	let passed = '';
	while (i < s.length) {
		let c = s[i];
		if (last[0] == c && last.length < 3) {
			if (last == '\\') {
				passed += last;
				last = '';
			} else {
				last += c;
			}
		} else {
			// first tag found
			if (mdChars[last[0]]) {
				let pos = null;
				for (let j = 0; j < last.length; j++) {
					//if (j && i - j == 1 && last[0] == '*') {
					//	continue;
					//}
					pos = detectMd(s, i - j, last.slice(0, last.length - j), c);
					if (pos) {
						let inner = parseMd(s.slice(i - j, pos[0]), pos[1]);
						o.contents.push(passed, inner);
						s = s.slice(pos[0] + last.length - j);
						passed = '';
						last = '';
						i = 0;
						break;
					}
				}
				if (pos) {
					continue;
				}
			}
			
			if (last == '\\') {
				last += c;
				c = '';
			}
			passed += last;
			last = c;
		}
		i++;
	}
	o.contents.push(passed + last);
	return o;
}

// stringifier
function plainText(o, ignored) {
	// "ignored" is a string of chars of styles, their content will be ignored
	let s = [];
	let c = o.contents;
	for (let i = 0; i < c.length; i++) {
		let t = c[i];
		if (typeof t != 'string') {
			if (ignored.indexOf(c[i].type) != -1) {
				s += '\n';
				continue;
			}
			t = plainText(t, ignored);
			if (c[i].type == 'c') {
				t = '\n' + t + '\n';
			}
		}
		s += t;
	}
	return s;
}

})(that);
